content/index.org
#+OPTIONS: toc:nil

I have been working in ML and Large Scale Distributed Systems for several years. In this site I try to share the lessons I've learnt


#+TOC: headlines 2

** [[file:llms_mosaci.org][Clever strategies for training LLMs with trillions of parameters]]
** [[file:llms.org][Challenges with commercial LLM APIs]]
** [[file:search.org][Real World Search at Internet Scale]]
** [[file:antipatterns.org][Antipatterns when dealing with non ML stakeholders]]
