index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<p>
I have been working in ML and Large Scale Distributed Systems for several years. In this site I try to share the lessons I've learnt
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgff82c45">Clever strategies for training LLMs with trillions of parameters</a></li>
<li><a href="#org546259e">Challenges with commercial LLM APIs</a></li>
<li><a href="#org618c056">Real World Search at Internet Scale</a></li>
<li><a href="#org17137cf">Antipatterns when dealing with non ML stakeholders</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgff82c45" class="outline-2">
<h2 id="orgff82c45"><a href="llms_mosaci.html">Clever strategies for training LLMs with trillions of parameters</a></h2>
</div>
<div id="outline-container-org546259e" class="outline-2">
<h2 id="org546259e"><a href="llms.html">Challenges with commercial LLM APIs</a></h2>
</div>
<div id="outline-container-org618c056" class="outline-2">
<h2 id="org618c056"><a href="search.html">Real World Search at Internet Scale</a></h2>
</div>
<div id="outline-container-org17137cf" class="outline-2">
<h2 id="org17137cf"><a href="antipatterns.html">Antipatterns when dealing with non ML stakeholders</a></h2>
</div>
</div>
</body>
</html>
